# Optional Functionality Utils Class

Source: https://www.revitapidocs.com/2026/98d35b3b-34ec-4105-f7c5-16e9215b6b52.htm

---

| Optional Functionality Utils Class |
| --- |

A collection of utilities that can be used to determine if a particular set of functionality is installed and available. Inheritance Hierarchy System Object
Autodesk.Revit.DB OptionalFunctionalityUtils

**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static class OptionalFunctionalityUtils
```

```
Public NotInheritable Class OptionalFunctionalityUtils
```

```
public ref class OptionalFunctionalityUtils abstract sealed
```

```
[<AbstractClassAttribute>]
[<SealedAttribute>]
type OptionalFunctionalityUtils = class end
```
The OptionalFunctionalityUtils type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Is3DMImportLinkAvailable | Checks whether the 3DM Import/Link functionality is available in the installed Revit. |
|  | IsAXMImportLinkAvailable | Checks whether the AXM Import/Link functionality is available in the installed Revit. |
|  | IsDGNExportAvailable | Checks whether the DGN Export functionality is available in the installed Revit. |
|  | IsDGNImportLinkAvailable | Checks whether the DGN Import/Link functionality is available in the installed Revit. |
|  | IsDWFExportAvailable | Checks whether the DWF/DWFx Export functionality is available in the installed Revit. |
|  | IsDWGExportAvailable | Checks whether the DWG Export functionality is available in the installed Revit. |
|  | IsDWGImportLinkAvailable | Checks whether the DWG Import/Link functionality is available in the installed Revit. |
|  | IsDXFExportAvailable | Checks whether the DXF Export functionality is available in the installed Revit. |
|  | IsFBXExportAvailable | Checks whether the FBX Export functionality is available in the installed Revit. |
|  | IsGraphicsAvailable | Checks whether the graphics functionality is available to support display, print, and export functionality. |
|  | IsIFCAvailable | Checks whether IFC functionality is available in the installed Revit. |
|  | IsMaterialLibraryAvailable | Checks whether the Material Library is available in the installed Revit. |
|  | IsNavisworksExporterAvailable | Checks whether a Navisworks Exporter is available in the installed Revit. |
|  | IsOBJImportLinkAvailable | Checks whether the OBJ Import/Link functionality is available in the installed Revit. |
|  | IsSATImportLinkAvailable | Checks whether the SAT Import/Link functionality is available in the installed Revit. |
|  | IsShapeImporterAvailable | Checks whether the ShapeImporter functionality and Material Library are available in the installed Revit. |
|  | IsSKPImportLinkAvailable | Checks whether the SKP Import/Link functionality is available in the installed Revit. |
|  | IsSTEPImportLinkAvailable | Checks whether the STEP Import/Link functionality is available in the installed Revit. |
|  | IsSTLImportLinkAvailable | Checks whether the STL Import/Link functionality is available in the installed Revit. |

Top See Also

#### Reference

Autodesk.Revit.DB Namespace